<html>
<head>
<title>FAQ</title>
<style>
    body,td,div {
	font-family : Verdana,Arial,Helvetica,sans-serif;
	font-size : .8em;
	color: black;
	background-color: white;
	text-align : justify;

    }
    table.main {
	background-color: black;
	width : 100%;
    }
    .help-topic {
	font-weight : bold;
	font-size : 1em;
	color : white;
	background-color : black;
    }
    .item {
	font-weight : bold;
	vertical-align : top;
	background-color: #cccccc;
    }
    .item-heading {
	font-weight : bold;
	vertical-align : top;
	text-align : center;
	background-color: #dddddd;
    }
    .item-desc {

    }
</style>
</head>
<body>
<table class="main" cellpadding=4 cellspacing=1>
    <tr class="help-topic">
	<td class="help-topic"><a href="http://www.post-nuke.com" target=_new><img src="../../../../images/global/manual.jpg" width="93" height="26" border="0" alt="PostNuke"></a></td>
	<td class="help-topic">FAQ</td>
    </tr>
    <tr>
	<td class="help-desc" colspan=2>
<UL>
<LI><B>FAQ:</B> Die <I>Frequently Asked Questions</I> begegnen einem bereits auf fast jeder Homepage der Hardwarehersteller. Man versteht darunter Informationen, die zusammengestellt werden, damit ein Hersteller nicht dauernd die gleichen Fragen beantworten mu&szlig;. (z.B. "Wie mu&szlig; ich das BIOS neu aufspielen?") Die Antwort m&uuml;&szlig;ten die Hersteller bestimmt 100 mal am Tag beantworten. Also stellt man entsprechende FAQs ins Netz, die die User ersteinmal durchsuchen k&ouml;nnen, wenn sie Probleme haben.<br>
Fragen k&ouml;nnen direkt &uuml;ber den FAQ-Link im Hauptmen&uuml; gestellt werden. Beim Klicken des Links wird der User auf eine Seite gebracht, wo er neben allen bisherigen FAQs auch ggfs. eine neue Frage stellen kann. Dazu gibt er neben der Frage seine Emailadresse und eine Kategorie (oder "unsicher", wenn er keine passende Kategorie findet und eine generelle Frage stellen m&ouml;chte) an und schickt die Frage ab. Der Administrator wird &uuml;ber offenstehende Fragen im Adminbereich informiert.<p>
Als Administrator kann man in Administration-->FAQ die folgenden Funktionen ausf&uuml;hren:<br>
<I>Unbeantwortete Fragen ansehen</I> gibt eine Liste mit offenen Fragen aus. Der Administrator kann die Fragen <I>beantworten oder l&ouml;schen</I> Um die Fragen zu beantworten, auf "Beantworten" klicken und die Antwort auf die Frage eingeben. Falls n&ouml;tig, kann man eine Kategorie f&uuml;r die Frage/Antwort ausw&auml;hlen und auf "Speichern" klicken. Die Frage/Antwort wird dann in die FAQ eingetragen. Wenn man die Frage "l&ouml;scht", wird man zur Best&auml;tigung des L&ouml;schvorgangs aufgefordert. Man kann den L&ouml;schvorgang abbrechen.<br>
Wenn <I>FAQ-Kategorien</I> existieren, werden diese oben im FAQ Modul angezeigt. Man kann die Kategorien editieren (Titel, Spracheinstellung oder Inhalt) oder l&ouml;schen. <br>
<I>L&ouml;scht</I> man eine Kategorie, werden alle Unterkategorien und alle Fragen/Antworten gel&ouml;scht, wenn man dieses mit "Ja" best&auml;tigt. Bei "Nein" bricht man den L&ouml;schvorgang ab.<br>
Nach dem <I>Editieren</I> einer Kategorie kann man &uuml;ber "Speichern" die Eintr&auml;ge sichern.<br>
Den <I>Inhalt</I> kann man <I>Einf&uuml;gen, Editieren oder L&ouml;schen</I> Im unteren Bereich der Seite kann man auch eine neue <I>Frage</I> eintragen und diese innerhalb der FAQ speichern.<p>
Um die FAQs zu nutzen, tr&auml;gt man zun&auml;chst eine oder mehrere <I>Kategorien</I> ein. Diese sollten sich an der Ausrichtung der Seite orientieren. Die eingetragene Kategorie wie gewohnt abspeichern.<br>
Mit der Sprache w&auml;hlt man, f&uuml;r welche Sprache die FAQ Kategorie angezeigt werden soll. Sollen alle User die Fragen und Antworten dieser Kategorie sehen k&ouml;nnen, dann einfach "alle" anw&auml;hlen.<p>
Will man innerhalb einer Kategorie noch Unterkategorien einsetzen, einfach rechts die &uuml;bergeordnete Hauptkategorie anstelle von "Neue Hauptkategorie" ausw&auml;hlen.
<p>
 </LI>
</ul>
	</td>
    </tr>
</table>

</body>
</html>
